hello @jgraichen @jtopjian 

i tried, but i get this error

```
Error: Invalid network configuration key: dns.search
```

i am using
```
      source  = "terraform-lxd/lxd"
      version = "1.5.0"
```

code

```
resource "lxd_network" "dc" {
  for_each = local.ip
  name     = each.key
  config = {
    "ipv4.address" = "${each.value}/24"
    "ipv4.nat"     = "true"
    "ipv6.address" = "none"
    "dns.domain"   = "${each.key}.test"
    "dns.search"   = "dc1.test,dc2.test,dc3.test,dc4.test"
  }
```

i tried with code above and get same error

```
  # lxd_network.example will be created
  + resource "lxd_network" "example" {
      + config  = {
          + "dns.search" = "example.org"
        }
      + id      = (known after apply)
      + managed = (known after apply)
      + name    = "example"
      + type    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

lxd_network.example: Creating...

Error: Invalid network configuration key: dns.search

  on t.tf line 1, in resource "lxd_network" "example":
   1: resource "lxd_network" "example" {


```

